Week04

#13 Konversi Nilai Numerik ke Dalam Sejumlah Kategori

In [1]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

Persiapakan Data Framenya

In [2]:
n_rows= 10
n_cols= 1
cols=('usia',)

df=pd.DataFrame(np.random.randint(1,99, size=(n_rows,n_cols)),
               columns=cols)
df

   usia
0    81
1    37
2    91
3    94
4    93
5     5
6    33
7    14
8     8
9    49

Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [3]:
df['kelompok_usia'] = pd.cut(df['usia'],
                            bins= [0,18,65,99],
                            labels = ['anak','dewasa','manula'])
df

   usia kelompok_usia
0    81        manula
1    37        dewasa
2    91        manula
3    94        manula
4    93        manula
5     5          anak
6    33        dewasa
7    14          anak
8     8          anak
9    49        dewasa

#14 Menggabungkan (merge) dua Data Frame

Import Modules

In [4]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [5]:
n_rows = 5
n_cols = 5
cols= tuple('abcde')
df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),
                 columns=cols)
df.head()

    a   b   c   d   e
0   2  14   3  12   5
1   6   3   6   3  18
2   8   4   5   2   4
3  15   7  11   3  17
4   9  15   9  15  10

In [6]:
df1= df.copy(deep = True)
df1= df1.drop([1,4])
df1

    a   b   c   d   e
0   2  14   3  12   5
2   8   4   5   2   4
3  15   7  11   3  17

In [7]:
df2= df.copy(deep = True)
df2= df2.drop([0,4])
df2

    a  b   c  d   e
1   6  3   6  3  18
2   8  4   5  2   4
3  15  7  11  3  17

Menggabungkan dua Data Frame

In [8]:
df_inner = pd.merge(df1,df2,how= 'inner')
df_inner

    a  b   c  d   e
0   8  4   5  2   4
1  15  7  11  3  17

In [9]:
df_outer = pd.merge(df1,df2, how= 'outer')
df_outer

    a   b   c   d   e
0   2  14   3  12   5
1   8   4   5   2   4
2  15   7  11   3  17
3   6   3   6   3  18

#15 Memecah nilai string dari suatu kolom ke dalam beberapa kolom baru

Import Modules

In [10]:
import pandas as pd
print(pd.__version__)

1.3.4

Persiapkan Data Frame

In [40]:
data = {'nama':['Didi Kempot','glenn fredly','Mbah Surip'],'tempat_kelahiran':['Surakarta,Jawa Tengah','Jakarta,DKI Jakarta','Mojokerto,Jawa Timur']}
df = pd.DataFrame(data)
df

           nama       tempat_kelahiran
0   Didi Kempot  Surakarta,Jawa Tengah
1  glenn fredly    Jakarta,DKI Jakarta
2    Mbah Surip   Mojokerto,Jawa Timur

Memecah Nama Depan dan nama belakang

In [38]:
df[['Nama_Depan','Nama_Belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama       tempat_kelahiran Nama_Depan Nama_Belakang
0   Didi Kempot  Surakarta,Jawa Tengah       Didi        Kempot
1  glenn fredly    Jakarta,DKI Jakarta      glenn        fredly
2    Mbah Surip  ,Mojokerto,Jawa Timur       Mbah         Surip

Memecah nama kota dan provinsi

In [41]:
df[['kota', 'provinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

           nama       tempat_kelahiran       kota     provinsi
0   Didi Kempot  Surakarta,Jawa Tengah  Surakarta  Jawa Tengah
1  glenn fredly    Jakarta,DKI Jakarta    Jakarta  DKI Jakarta
2    Mbah Surip   Mojokerto,Jawa Timur  Mojokerto   Jawa Timur

#16 Menata Ulang Data Frame dengan multiple indexes menggunakan unstack()

import modules

In [42]:
import pandas as pd
print(pd.__version__)

1.3.4

Persiapkan Data Frame

In [50]:
df = pd.read_csv('titanic3.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

Data Frame dengan multiple indexs dari hasil groupping

In [51]:
df.groupby(['sex','pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

Persiapkan Data Frame

In [52]:
df=pd.read_csv('titanic3.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

Data Frame multiple indexes dari hasil groupping

In [53]:
df.groupby(['sex','pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

Data Frame dengan multiple indexes dari hasil groupping

In [54]:
df.groupby(['sex','pclass'])['survived'].mean()

sex     pclass
female  1         0.965278
        2         0.886792
        3         0.490741
male    1         0.340782
        2         0.146199
        3         0.152130
Name: survived, dtype: float64

Menata Ulang Data Frame dengan multiple indexes

In [55]:
df.groupby(['sex','pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130